*** Example - How to sum from 1 to 10 with =inject=

#+BEGIN_QUOTE
In functional programming, fold – also known variously as reduce, accumulate, aggregate, compress, or inject – refers to a family of higher-order functions that analyze a recursive data structure and recombine through use of a given combining operation the results of recursively processing its constituent parts, building up a return value. Typically, a fold is presented with a combining function, a top node of a data structure, and possibly some default values to be used under certain conditions. The fold then proceeds to combine elements of the data structure's hierarchy, using the function in a systematic way.[fn:1] Wikipedia - Fold (higher-order function)
#+END_QUOTE

#+name: example-sum-1-to-10-with-inject-ruby
#+begin_src ruby
(1..10).inject(&:+)
#+end_src

#+RESULTS: example-sum-1-to-10-with-inject-ruby
: 55

*** Playing around

    #+BEGIN_SRC ruby :var data1='(("a") ("b") ("c")) :var data2='(("a" "e" "i") ("f" "b" "j") ("g" "c" "k") ("h" "l" "d")) :exports both
      # data1
      # data2
      # data1.map{|d1| data2.map{|d2| d1 + d2}}
      # data1.map{|d1| data2.map{|d2| d1 | d2}}
      # data1.map{|d1| data2.map{|d2| d1 - d2}}
      # data1.map{|d1| data2.map{|d2| d1 & d2}}
      # data2.map{|d2| data1.map{|d1| d2 + d1}}
      # data2.map{|d2| data1.map{|d1| d2 | d1}}
      # data2.map{|d2| data1.map{|d1| d2 - d1}}
       data2.map{|d2| data1.map{|d1| d2 & d1}}
    #+END_SRC

    #+RESULTS:
    | (a) | nil | nil |
    | nil | (b) | nil |
    | nil | nil | (c) |
    | nil | nil | nil |



